In [358]:
import pandas as pd
import numpy as np

data = pd.read_csv('/Users/sandy/data-analysis-projects/data-manipulation/exercises/titanic.csv')

In [359]:
import pandas as pd
df = pd.read_csv('/Users/sandy/data-analysis-projects/data-manipulation/exercises/titanic.csv')
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [360]:
# check for duplicates
data.duplicated().sum()

np.int64(107)

In [361]:
# if there are, go ahead and drop them:
data.drop_duplicates()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [362]:
#Aggregation - Groupby
# Code your groupby "embark_town" here:
# To view the grouped data as a table, use the variable_name.first():
data_group = data.groupby("embark_town") 
data_group.first()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone
embark_town,,,,,,,,,,,,,,
Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,yes,False
Queenstown,0,3,male,2.0,0,0,8.4583,Q,Third,man,True,C,no,True
Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,no,False

In [363]:
# Code your groupby "survived" table here:
# run your table below:
# run your table with describe
# How is this table organized?  Why are there 40 columns now?

survive_group = data.groupby("survived").describe()

In [364]:
#Aggregation Method #2
# Create a variable to apply agg() to your grouped data.
#Pass one of the following statistical values to agg() "mean", "median", "mode", "min", "max", "std", "var", "first", "last", "sum"
# Code your method chain here:

mean_data = data_group.head().agg('mean', numeric_only=True) 
mean_data.head()

survived     0.533333
pclass       2.400000
age         28.100000
sibsp        0.533333
parch        0.066667
dtype: float64

In [365]:
#Create a variable to method chain head() with agg("sum")
sum_data = data_group.head().agg("sum", numeric_only=True)
sum_data.head()

survived      8.0
pclass       36.0
age         281.0
sibsp         8.0
parch         1.0
dtype: float64

In [366]:
# Explain the sum table.  What is going on with the "sex", "class", and "alive" columns?

In [367]:
#1. What if we want to look at more than one column at a time?  We pass more dictionaries to the agg function.
#Create a variable to hold at least 3 columns.  Use the syntax from the "Syntax Example" as a guide. - Aggregate the following:  survived: "sum" & "count"; age: "std" & "min", and sibsp: "count" & "sum"

test_dictionary={"survived": ["sum", "count"], 
                 "age": ["std", "min"], 
                 "sibsp": ["count","sum"]
                }
dictionary_agg=data.agg(test_dictionary)

In [368]:
#Group By and Basic Math
# <WARNING> For this section, you will need to filter out non-numeric data to run the aggregations
# The line below creates a new dataframe with only numeric columns to avoid warnings
num_only_data = data.select_dtypes(include='number')
# Code your groupby here using num_only_data:
# Run your table using first() here instead of head():


grouped_data = num_only_data.groupby("pclass")
result = grouped_data
result.first()

        survived   age  sibsp  parch     fare
pclass
1              1  38.0      1      0  71.2833
2              1  14.0      1      0  30.0708
3              0  22.0      1      0   7.2500

In [369]:
# our list of functions
agg_func_list = ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']

#Apply the agg method to our passenger_class variable (made in the Groupby Basic Math section).  
# Pass our list to the function and run your table.

result.agg(agg_func_list)

       survived                                                                \
            sum      mean median min max       std       var first last count
pclass
1           136  0.629630    1.0   0   1  0.484026  0.234281     1    1   216
2            87  0.472826    0.0   0   1  0.500623  0.250624     1    0   184
3           119  0.242363    0.0   0   1  0.428949  0.183998     0    0   491

        ...        fare                                                \
        ...         sum       mean   median  min       max        std
pclass  ...
1       ...  18177.4125  84.154687  60.2875  0.0  512.3292  78.380373
2       ...   3801.8417  20.662183  14.2500  0.0   73.5000  13.417399
3       ...   6714.6951  13.675550   8.0500  0.0   69.5500  11.778142


                var    first   last count
pclass
1       6143.482816  71.2833  30.00   216
2        180.026589  30.0708  13.00   184
3        138.724622   7.2500   7.75   491

[3 rows x 50 columns]

In [370]:
#Looking at the *age_func_dict* syntax, create a dictionary variable for the "survived" column and pass it to **passenger_class.agg()** in the box below.
# Code it here:

agg_func_dict = {
    'survived':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
result.agg(agg_func_dict)

       survived
            sum      mean median min max       std       var first last count
pclass
1           136  0.629630    1.0   0   1  0.484026  0.234281     1    1   216
2            87  0.472826    0.0   0   1  0.500623  0.250624     1    0   184
3           119  0.242363    0.0   0   1  0.428949  0.183998     0    0   491

In [371]:
# Code your new "fare_2021" column here:
# Run the head of your table to see your new column:

data['fare_2021'] = data['fare'] * 145
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1051.2500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,10336.0785
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1149.1250
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,7699.5000
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1167.2500

In [372]:
# Code your updated values here:

data['alive'] = data['alive'].replace({'yes': True, 'no': False})
data.head()

/var/folders/d9/nbkjm7_d417fp3m4463v65h80000gn/T/ipykernel_9464/923878602.py:3: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['alive'] = data['alive'].replace({'yes': True, 'no': False})

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,1051.2500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False,10336.0785
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True,1149.1250
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False,7699.5000
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,1167.2500

In [373]:
### Using a function to create a new column 
# Write your max age check here:

max_age = data['age'].max()
print("Maximum age:", max_age)
bins = [0, 20, 30, 40, 50, 60, 70, 80, 90, 100]  
labels = ["0-19", "20-29", "30-39", "40-49", "50-59", "60-69", "70-79", "80-89", "90-99"]
data['age_group'] = pd.cut(data['age'], bins=bins, labels=labels, include_lowest=True)
data.head()

Maximum age: 80.0

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021,age_group
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,1051.2500,20-29
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False,10336.0785,30-39
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True,1149.1250,20-29
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False,7699.5000,30-39
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,1167.2500,30-39

In [374]:
# Code the new "age_group" column function here:

sorted_data = data.sort_values(by='fare', ascending=False)

sorted_data[['age', 'fare']].head(1)

      age      fare
258  35.0  512.3292

In [375]:
# Code your sort_values here:
# Run your table here:

import numpy as np

pivot = data.pivot_table(
    values='fare',          
    index=['who', 'age_group'],  
    columns='survived',  
    aggfunc=np.sum       
)
pivot

/var/folders/d9/nbkjm7_d417fp3m4463v65h80000gn/T/ipykernel_9464/3892264185.py:6: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot = data.pivot_table(
/var/folders/d9/nbkjm7_d417fp3m4463v65h80000gn/T/ipykernel_9464/3892264185.py:6: FutureWarning: The provided callable <function sum at 0x1054ace00> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pivot = data.pivot_table(

survived                 0          1
who   age_group
child 0-19       1109.5459  1611.6751
      20-29         0.0000     0.0000
      30-39         0.0000     0.0000
      40-49         0.0000     0.0000
      50-59         0.0000     0.0000
      60-69         0.0000     0.0000
      70-79         0.0000     0.0000
      80-89         0.0000     0.0000
      90-99         0.0000     0.0000
man   0-19       1058.4041   176.4292
      20-29      2518.3037   625.5583
      30-39      1429.4705  1742.4459
      40-49      1207.7708   569.3293
      50-59       735.4792   171.7500
      60-69       602.4375    10.5000
      70-79        99.6834    30.0000
      80-89         0.0000     0.0000
      90-99         0.0000     0.0000
woman 0-19        144.6250  1243.0209
      20-29       419.0750  2947.6083
      30-39       141.5667  3273.4124
      40-49       260.4917  1502.4418
      50-59        10.5000   962.8125
      60-69         0.0000   167.5458
      70-79         0.0000     0.0000
      80-89         0.0000     0.0000
      90-99         0.0000     0.0000

In [376]:
# Code your pivot_table here:
# Run your table here:

new_pivot= data.pivot_table(
    values='pclass',
    columns='who',
    aggfunc=np.sum  
)
new_pivot

/var/folders/d9/nbkjm7_d417fp3m4463v65h80000gn/T/ipykernel_9464/2237441393.py:4: FutureWarning: The provided callable <function sum at 0x1054ace00> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  new_pivot= data.pivot_table(

who     child   man  woman
pclass    218  1274    565

In [377]:
# Code your table here:
# Run your table here:
# Answer the question here:

# "who" is used as the column labels instead of being part of the row index like in the previous pivot table

In [378]:
# What does melt do?

#reshape a DataFrame from a "wide" format to a "long" format

In [379]:
# Create your default melt table here with the following syntax:  new_name = pd.melt(data_set)
# Run your table here:
# Check the shape of your new table.

melted_data = pd.melt(data)

melted_data.head()

melted_data.shape

(15147, 2)

In [380]:
# Create your melt table here:

# Run your table here:

# Check the shape


melted_data_two = pd.melt(
    data,
    id_vars=['embarked'], 
    value_vars=['fare', 'deck']
)
melted_data_two.head()

melted_data_two.shape

(1782, 3)